app/views/users/show.html.erb

SELECT COUNT(*) FROM "academics" WHERE ("academics".user_id = 3)
---
	  <%= render 'help_form' if signed_in? %>
	  <% unless @user.academics.empty? %>