app/controllers/academics_controller.rb

  def create
    @academic  = current_user.academics.build(params[:academic])
    if @academic.save
---
INSERT INTO "academics" ("updated_at", "created_at", "description", "user_id", "learn", "teach") VALUES ('2010-12-08 16:10:36.634965', '2010-12-08 16:10:36.634965', 'first post', 101, 'english', 'math')