app/controllers/users_controller.rb

  def helping
    @title = "Helping"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 101) LIMIT 1

  def helpers
    @title = "helpers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 101) LIMIT 1

  def show
    @user = User.find(params[:id])
    @academics = @user.academics.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "academics".* FROM "academics" WHERE ("academics".user_id = 3) ORDER BY academics.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "academics" WHERE ("academics".user_id = 3)

  def create
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("email", "admin", "updated_at", "name", "encrypted_password", "created_at", "salt") VALUES ('three@college.harvard.edu', 'f', '2010-12-08 22:01:00.934873', 'three', 'f90c6a0cf6c046526f53a6d86aa97566308a690c1aab1d644e62327941224d15', '2010-12-08 22:01:00.934873', '48d422a0685cb671dd01f236e7cb7167e63ed97e8f255022e1e48c097852ef3f')

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 101) LIMIT 1